In [15]:
import pandas as pd

In [73]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace"],
    "Age": [25, 30, 35, 40, 28, 33, 27],
    "City": ["Karachi", "Lahore", "Islamabad", "Quetta", "Multan", "Peshawar", "Hyderabad"],
    "Occupation": ["Engineer", "Doctor", "Teacher", "Architect", "Artist", "Lawyer", "Designer"],
    "Salary": [75000, 120000, 95000, 110000, 67000, 85000, 72000]
}
df = pd.DataFrame(data)

In [75]:
df

      Name  Age       City Occupation  Salary
0    Alice   25    Karachi   Engineer   75000
1      Bob   30     Lahore     Doctor  120000
2  Charlie   35  Islamabad    Teacher   95000
3    David   40     Quetta  Architect  110000
4      Eva   28     Multan     Artist   67000
5    Frank   33   Peshawar     Lawyer   85000
6    Grace   27  Hyderabad   Designer   72000

In [77]:
print("Shape of DataFrame:", df.shape)

Shape of DataFrame: (7, 5)

In [79]:
print("\nSummary statistics:")
print(df.describe())

Summary statistics:
             Age         Salary
count   7.000000       7.000000
mean   31.142857   89142.857143
std     5.209881   20095.012411
min    25.000000   67000.000000
25%    27.500000   73500.000000
50%    30.000000   85000.000000
75%    34.000000  102500.000000
max    40.000000  120000.000000

In [81]:
df.tail()

      Name  Age       City Occupation  Salary
2  Charlie   35  Islamabad    Teacher   95000
3    David   40     Quetta  Architect  110000
4      Eva   28     Multan     Artist   67000
5    Frank   33   Peshawar     Lawyer   85000
6    Grace   27  Hyderabad   Designer   72000

In [83]:
 df.columns

Index(['Name', 'Age', 'City', 'Occupation', 'Salary'], dtype='object')

In [85]:
df.head()

      Name  Age       City Occupation  Salary
0    Alice   25    Karachi   Engineer   75000
1      Bob   30     Lahore     Doctor  120000
2  Charlie   35  Islamabad    Teacher   95000
3    David   40     Quetta  Architect  110000
4      Eva   28     Multan     Artist   67000

In [87]:
city= df['City']
print('Cities of indivitual:')
print(city)

Cities of indivitual:
0      Karachi
1       Lahore
2    Islamabad
3       Quetta
4       Multan
5     Peshawar
6    Hyderabad
Name: City, dtype: object

In [89]:
df['City'] == 'Karachi'

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: City, dtype: bool

In [91]:
df[df['City'] == 'Karachi']

    Name  Age     City Occupation  Salary
0  Alice   25  Karachi   Engineer   75000

In [93]:
a= df['City'] == 'Karachi'

In [95]:
df[a]

    Name  Age     City Occupation  Salary
0  Alice   25  Karachi   Engineer   75000

In [123]:
df['City'] == 'Karachi' , 'Quetta'

(0     True
 1    False
 2    False
 3    False
 4    False
 5    False
 6    False
 Name: City, dtype: bool,
 'Quetta')

In [131]:
b= df['City'] == 'Karachi' , 'Quetta'
df[b]

InvalidIndexError: (0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: City, dtype: bool, 'Quetta')

In [59]:
df

      name  Age       City Occupation  Salary
0    Alice   25    Karachi   Engineer   75000
1      Bob   30     Lahore     Doctor  120000
2  Charlie   35  Islamabad    Teacher   95000
3    David   40     Quetta  Architect  110000
4      Eva   28     Multan     Artist   67000
5    Frank   33   Peshawar     Lawyer   85000
6    Grace   27  Hyderabad   Designer   72000

In [117]:
older_people=df[df['Age']>30]
print("Individuals with Age greater than 30:")
older_people

Individuals with Age greater than 30:

      Name  Age       City Occupation  Salary
2  Charlie   35  Islamabad    Teacher   95000
3    David   40     Quetta  Architect  110000
5    Frank   33   Peshawar     Lawyer   85000

In [119]:
df['Age']

0    25
1    30
2    35
3    40
4    28
5    33
6    27
Name: Age, dtype: int64

In [121]:
df[  ['Name', 'Occupation']  ]

      Name Occupation
0    Alice   Engineer
1      Bob     Doctor
2  Charlie    Teacher
3    David  Architect
4      Eva     Artist
5    Frank     Lawyer
6    Grace   Designer